#include <iostream>

//Παράσταση δυαδικού δένδρου αναζήτησης ακεραίων αριθμών
class bstree {
public:
      bstree ();        // κατασκευάζει ένα κενό ΔΔΑ 
 int  height ();        // επιστρέφει το ύψος του ΔΔΑ  
 void insert (int x);   // εισάγει τον αριθμό x στο ΔΔΑ 
 int  search (int x);   // ψάχνει τον αριθμό x στο ΔΔΑ και επιστρέφει το επίπεδο στο οποίο βρίσκεται (η ρίζα βρίσκεται στο επίπεδο 1) ή 0 αν δεν υπάρχει 
 int  min ();           // επιστρέφει το ελάχιστο στοιχείο του ΔΔΑ */
 int  max ();           // επιστρέφει το μέγιστο στοιχείο του ΔΔΑ */
 void inorder ();       // εκτυπώνει τα στοιχεία του ΔΔΑ με ενδοδιατεταγμένη διάσχιση 
 void preorder ();      // εκτυπώνει τα στοιχεία του ΔΔΑ με προδιατεταγμένη διάσχιση 
 void postorder ();     // εκτυπώνει τα στοιχεία του ΔΔΑ με μεταδιατεταγμένη διάσχιση 

 private:
 
 //Δομή για κάθε κόμβο
 struct node{
   int info;
   node *left, *right;
 };
 typedef node *tree;
};

int main() {
  std::cout << "Hello World!\n";
}